multiload-test.yml
config:
  target: "http://localhost:5001"

  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm up phase"

    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: "Increasing load"

    - duration: 30
      arrivalRate: 15
      name: "Peak traffic"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "User browsing reviews, courses, and jobs"

    flow:

      # Fetch reviews
      - get:
          url: "/api/reviews"
          expect:
            - statusCode: 200
      - think: 2

      # Fetch courses
      - get:
          url: "/api/courses"
          expect:
            - statusCode: 200
      - think: 2

      # Simulate browsing job listings multiple times
      - loop:
          - get:
              url: "/api/jobs"
              expect:
                - statusCode: 200
          - think: 1
        count: 3